## 데이터 입출력
- csv, excil, html, json, hdf5, sas, stata, sql....
- csv : 쉽포로 구분되어 있는 텍스트 파일

In [1]:
import numpy as np
import pandas as pd

In [18]:
%%writefile sample.csv
no, score, name
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting sample.csv

In [21]:
%ls

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: CA93-A4FE

 C:\k_digital\source\Data Science with Python 디렉터리

2022-10-26  오전 09:11    <DIR>          .
2022-10-26  오전 09:11    <DIR>          ..
2022-10-26  오전 09:01    <DIR>          .ipynb_checkpoints
2022-10-24  오전 10:21    <DIR>          __pycache__
2022-10-25  오후 12:29           132,568 1. Numpy.ipynb
2022-10-25  오후 01:32             5,995 2. 기술 통계.ipynb
2022-10-25  오후 05:47            69,207 3. Pandas.ipynb
2022-10-26  오전 09:11             3,000 4. Pandas 데이터 분석.ipynb
2022-10-24  오후 12:19               152 my_array1.npy
2022-10-24  오후 12:21               554 my_array2.npz
2022-10-26  오전 09:11                61 sample.csv
2022-10-24  오전 10:19               186 teacher.py
               8개 파일             211,723 바이트
               4개 디렉터리  186,495,131,648 바이트 남음

In [22]:
# csv 피일 읽기

In [23]:
pd.read_csv('sample.csv')

   no   score    name
0   1    1.11     one
1   2    2.22     two
2   3    3.33   three

In [24]:
%%writefile sample1.csv
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample1.csv

In [33]:
# 머리끌 없는 경우
pd.read_csv('sample1.csv', header=None)

   0     1       2
0  1  1.11     one
1  2  2.22     two
2  3  3.33   three

In [35]:
# 가져온 동시에 이름을 지정하기
pd.read_csv('sample1.csv', names=['c1','c2','c3'])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [37]:
# 있는 컬럼이름으로 index로 지정
pd.read_csv('sample.csv', index_col=['no'])

     score    name
no
1     1.11     one
2     2.22     two
3     3.33   three

In [39]:
%%writefile sample2.txt
c1     c2    c3  c4
0.179187 -1.538472 1.347553 0.43381
1.179187 -2.538472 1.347553 0.43382
2.179187 -3.538472 1.347553 0.43383
3.179187 -4.538472 1.347553 0.43384
4.179187 -5.538472 1.347553 0.43385

Writing sample2.txt

In [ ]:
#                     공백의 길이 일정하지 않음 sep='\s+'
pd.read_csv('sample.txt', sep='\s+')

In [40]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [41]:
# Pandas csv로 저장할 떄 
# xxx.to_csv('name')
df.to_csv('sample3.csv', index=True, header=True)

In [43]:
!type sample3.csv

,state,year,pop
0,Ohio,2000,1.5
1,Ohio,2001,1.7
2,Ohio,2002,3.6
3,Nevada,2001,2.4
4,Nevada,2002,2.9
5,Nevada,2003,3.2

In [44]:
%ls

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: CA93-A4FE

 C:\k_digital\source\Data Science with Python 디렉터리

2022-10-26  오전 09:27    <DIR>          .
2022-10-26  오전 09:27    <DIR>          ..
2022-10-26  오전 09:01    <DIR>          .ipynb_checkpoints
2022-10-24  오전 10:21    <DIR>          __pycache__
2022-10-25  오후 12:29           132,568 1. Numpy.ipynb
2022-10-25  오후 01:32             5,995 2. 기술 통계.ipynb
2022-10-25  오후 05:47            69,207 3. Pandas.ipynb
2022-10-26  오전 09:27            16,557 4. Pandas 데이터 분석.ipynb
2022-10-24  오후 12:19               152 my_array1.npy
2022-10-24  오후 12:21               554 my_array2.npz
2022-10-26  오전 09:11                61 sample.csv
2022-10-26  오전 09:14                44 sample1.csv
2022-10-26  오전 09:22               206 sample2.txt
2022-10-26  오전 09:27               125 sample3.csv
2022-10-24  오전 10:19               186 teacher.py
              11개 파일             225,655 바이트
               4개 디렉터리  186,495,545,344 바이트 남음

## 데이터프레임 고급 인덱싱

In [ ]:
# loc : 라벨값 기준으로 인덱싱 df.loc[행 라벨 , 열 라벨]
# iloc : 정수 기반의 인덱싱

In [47]:
df = pd.DataFrame (np.arange(10,22).reshape(3,4),
                  index = list('abc'),
                  columns = ['one','two','three','four'])
df

   one  two  three  four
a   10   11     12    13
b   14   15     16    17
c   18   19     20    21

In [49]:
# 인덱싱값 하나만 받아오는 경우

df.loc[['b']]

   one  two  three  four
b   14   15     16    17

In [56]:
# loc 쓰지 않아도 됨

df['b':'c']

df.loc['b':'c']

   one  two  three  four
b   14   15     16    17
c   18   19     20    21

In [58]:
# 하지만 인덱싱 아닌 경우 loc를 써야 함, 
# loc 안쓰면 Error

df.loc[['b','c']]

   one  two  three  four
b   14   15     16    17
c   18   19     20    21

In [61]:
df['one']
df.one

a    10
b    14
c    18
Name: one, dtype: int32

In [62]:
df.one > 15

a    False
b    False
c     True
Name: one, dtype: bool

In [63]:
# 행추출
df[df.one>15]

   one  two  three  four
c   18   19     20    21

In [64]:
# 행추출
# 이때 loc 써도 됨
df.loc[df.one>15]

   one  two  three  four
c   18   19     20    21

In [65]:
def select_row(df) :
    return df.one > 15

In [67]:
select_row(df)

a    False
b    False
c     True
Name: one, dtype: bool

In [69]:
df[select_row(df)]

   one  two  three  four
c   18   19     20    21

In [ ]:
# **실수 중의**
df.loc['one'] #Error
#loc는 행만 추출할 수 있다

In [75]:
df2 = pd.DataFrame(np.arange(10, 26).reshape(4,4),
                  columns=list('ABCD'))
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [77]:
# loc를 index처럼 사용하면 
# i~n까지 출력함 
# i~(n-1)까지 아님

df2.loc[1:2]

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

#### 인덱실값을 이용해 행과 열 모두 추출하는 겨우
- df.loc[행인덱스, 열인덱스]

In [81]:
df2.loc[0,'A']

10

In [83]:
df

   one  two  three  four
a   10   11     12    13
b   14   15     16    17
c   18   19     20    21

In [85]:
# 15일거옴
df.loc['b','two']

15

In [87]:
df.loc['b':,'one']

b    14
c    18
Name: one, dtype: int32

In [89]:
df.loc['a',:]

one      10
two      11
three    12
four     13
Name: a, dtype: int32

In [95]:
df.loc[['a','b'],['two','four']]

   two  four
a   11    13
b   15    17

In [99]:
# one 10보다 큰 행중에 three과 four열의 값을 출력
df.loc[df.one > 10, ['three', 'four']]

   three  four
b     16    17
c     20    21

In [108]:
df.loc['a','one'] > 5

True

In [133]:
df.loc[df.one > 10, ['three', 'four']].loc[['b']]

   three  four
b     16    17

### iloc 인덱싱

In [120]:
df

   one  two  three  four
a   10   11     12    13
b   14   15     16    17
c   18   19     20    21

In [122]:
df.iloc[0,1]

11

In [134]:
df.iloc[:2, 2]

SyntaxError: invalid syntax (Temp/ipykernel_4784/534795198.py, line 1)

In [127]:
df.iloc[0, -2:]

three    12
four     13
Name: a, dtype: int32

In [131]:
df.iloc[2:3,1:3]

   two  three
c   19     20

In [137]:
df.iloc[[-1]]

   one  two  three  four
c   18   19     20    21

In [141]:
df.iloc[-1] = df.iloc[-1] * 10
df

    one   two  three  four
a    10    11     12    13
b    14    15     16    17
c  7200  7600   8000  8400

##### Q 
#### 모든 행과 열에 라벨을 가지고 있는 5행 5열 이상의 크기를 가지는 데이터프레임을 생성
#### 10가지 이상의 방법을 이용하여 특정 행 또는 열 또는 행과열을 추출하는 작업을 수행

In [226]:
ddf = pd.DataFrame(np.arange(25).reshape(5, 5),
                  columns = list('ABCDE'))
ddf

    A   B   C   D   E
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [156]:
# 1
ddf.A

0     0
1     5
2    10
3    15
4    20
Name: A, dtype: int32

In [157]:
# 2
ddf['A']

0     0
1     5
2    10
3    15
4    20
Name: A, dtype: int32

In [158]:
# 3
ddf.loc[ :, ['A','E']]

    A   E
0   0   4
1   5   9
2  10  14
3  15  19
4  20  24

In [179]:
# 4
ddf.iloc[0:3]

    A   B   C   D   E
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14

In [183]:
# 5
ddf.iloc[0:3].A

0     0
1     5
2    10
Name: A, dtype: int32

In [184]:
# 6
ddf.iloc[]

In [198]:
# 7
ddf.loc[ddf.A > 2, ['C', 'D']].loc[[2]]

    C   D
2  12  13

In [201]:
# 8
ddf.iloc[-2:,-2:]

    D   E
3  18  19
4  23  24

In [232]:
# 9
ddf.loc[:,'A'].iloc[1:4]

1     5
2    10
3    15
Name: A, dtype: int32

In [253]:
# 10
nan = ddf > 5

ddf[~pd.notnull(ddf[nan])]

     A    B    C    D    E
0  0.0  1.0  2.0  3.0  4.0
1  5.0  NaN  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN  NaN

## 데이터 조작

#### 데이터 객수 세기 : count

In [258]:
s = pd.Series(range(10))
s[3] = np.nan
print(s)

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [260]:
s.count() # NaN 미포함의 객수

9

In [273]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4,4)), dtype =float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [275]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [2]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [283]:
# 데이터 내용 미리보기 : head() or tail()
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [284]:
titanic.shape

(891, 15)

In [286]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [288]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [291]:
#********* 돗수분포 value_counts *********  -> 시리즈 타입 출력해주야함 titanic['embarked'] 이런 식으로
# 고유값 unique들의 건수 R에서는 table()이다
# 건수 계산 함수
# 돗수분포 value_counts
#****************************************
# embarked 탑숭구

titanic['embarked'].value_counts()

S    644
C    168
Q     77
Name: embarked, dtype: int64

In [293]:
# 객실 등급별 승객수를 추출하시오
titanic['pclass'].value_counts() # value_counts() 시행할 떄 sort_value() 가본적으로 싱행

3    491
1    216
2    184
Name: pclass, dtype: int64

### 정렬
- sort_index()
- sort_values()

In [296]:
titanic['pclass'].value_counts().sort_index()

1    216
2    184
3    491
Name: pclass, dtype: int64

In [300]:
# age 정렬
titanic['age'].sort_values(ascending=False) # 내림차순

630    80.0
851    74.0
493    71.0
96     71.0
116    70.5
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: age, Length: 891, dtype: float64

In [305]:
#데이터프레임 전체로 key값이 없기 떄문에
# by= 로지 정한 값으로 기분이 됨
titanic.sort_values(by=['age', 'pclass']) # ascending=False

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
803,1,3,male,0.42,0,1,8.5167,C,Third,child,False,NaN,Cherbourg,yes,False
755,1,2,male,0.67,1,1,14.5000,S,Second,child,False,NaN,Southampton,yes,False
469,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
644,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
78,1,2,male,0.83,0,2,29.0000,S,Second,child,False,NaN,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [313]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size=100))
s2.tail()

95    4
96    5
97    2
98    4
99    3
dtype: int32

In [315]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [317]:
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [319]:
df[0].value_counts()

3.0    2
0.0    1
4.0    1
Name: 0, dtype: int64

In [321]:
s2.value_counts().sort_index()

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

In [323]:
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [325]:
s.sort_values()

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [327]:
s.sort_values(ascending=False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

In [333]:
df[2].sort_values()

1    2.0
0    3.0
2    4.0
3    4.0
Name: 2, dtype: float64

In [335]:
df.sort_values(by=2)

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [337]:
df.sort_values(by=[1, 2], ascending=False)

     0    1    2    3
3  4.0  3.0  4.0  2.0
2  3.0  2.0  4.0  NaN
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0

#### titanic 데이터섯을 이용하여 승객의 성별 인원수, 나이별 인원수, 객실별인원수, 사망/생존 인원수 추출
- 컬럼별 인원수 : value_counts()
- sort_values() 이용할 것

In [356]:
# 승객의 성별 인원수
# sexa

titanic.sort_values(by='sex').value_counts('sex')

sex
male      577
female    314
dtype: int64

In [357]:
# 나이별 인원수
# age

titanic.sort_values(by='age').value_counts('age')

age
24.00    30
22.00    27
18.00    26
30.00    25
28.00    25
         ..
20.50     1
14.50     1
12.00     1
0.92      1
80.00     1
Length: 88, dtype: int64

In [358]:
# 객실별인원수 
# pclass

titanic.sort_values(by='pclass').value_counts('pclass')

pclass
3    491
1    216
2    184
dtype: int64

In [359]:
# 사망/생존 인원수 추출 
# alive

titanic.sort_values(by='alive').value_counts('alive')

alive
no     549
yes    342
dtype: int64

### 행/열 합계
- sum(axis), axis = 0 행,  axis = 1 열

In [12]:
df2 = pd.DataFrame(np.random.randint(10, size = (4,8)))
df2

   0  1  2  3  4  5  6  7
0  5  0  8  1  9  9  9  2
1  1  0  1  3  5  0  2  8
2  8  9  4  7  7  7  5  9
3  4  5  9  6  1  9  4  1

In [10]:
# 해방향의 합계
df2.sum(axis=1)

0    28
1    42
2    34
3    33
dtype: int64

In [15]:
df2['rowSum'] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  rowSum
0  5  0  8  1  9  9  9  2     129
1  1  0  1  3  5  0  2  8      60
2  8  9  4  7  7  7  5  9     168
3  4  5  9  6  1  9  4  1     117

In [17]:
df2.sum() # axis = 0 생략

0          18
1          14
2          22
3          17
4          22
5          25
6          20
7          20
rowSum    474
dtype: int64

In [19]:
df2.loc['total', : ] = df2.sum()
df2

          0     1     2     3     4     5     6     7  rowSum
0       5.0   0.0   8.0   1.0   9.0   9.0   9.0   2.0   129.0
1       1.0   0.0   1.0   3.0   5.0   0.0   2.0   8.0    60.0
2       8.0   9.0   4.0   7.0   7.0   7.0   5.0   9.0   168.0
3       4.0   5.0   9.0   6.0   1.0   9.0   4.0   1.0   117.0
total  36.0  28.0  44.0  34.0  44.0  50.0  40.0  40.0   948.0

### 연습문제
1. 타이타닉호에 등객들의 평균 나이를 추출하시오
2. 타이타닉호에 승객증 여성 승객의 평균 나이를 추출
3. 타이타틱호에 승객중 1등실에 탑승한 여성 승객의 평균 나이를 추출

In [3]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [4]:
#타이타닉호에 등객들의 평균 나이를 추출하시오
titanic['age'].mean()

29.69911764705882

In [11]:
# 타이타닉호에 승객증 여성 승객의 평균 나이를 추출
titanic.loc[titanic.sex == 'female', 'age'].mean()

27.915708812260537

In [8]:
#타이타틱호에 승객중 1등실에 탑승한 여성 승객의 평균 나이를 추출
titanic.loc[(titanic.sex == 'female') & (titanic['pclass']) == 1, 'age'].mean()

SyntaxError: invalid syntax (Temp/ipykernel_6448/496260052.py, line 2)

#### apply 함수
- 행이나 열에 반복적으로 처리하는 계산
- 람다(lambda) 함수 : 익명의 함수
- 형식 : lambda  입력 : 출력값

In [49]:
# 두 수를 입력받아 합을 계산하는 함수
def hap(x, y) :
    return x + y

hap(10, 20)

30

In [55]:
# 람다 형식으로 표현하려면
(lambda x, y : x + y)(10, 20)

30

#### map(함수, 리스트)

In [57]:
list(map((lambda x : x**2), range(5)))

[0, 1, 4, 9, 16]

In [60]:
df3 = pd.DataFrame({
    'A':[1, 3, 4, 3, 4],
    'B':[2, 3, 1, 2, 3],
    'C':[1, 5, 2, 4, 4]})

In [65]:
# 각 열에 최대값과 최소값의 차이를 구하시오
df3.apply(lambda x : x.max() - x.min(), axis=0)

A    3
B    2
C    4
dtype: int64

In [67]:
# 각 행에 최대값과 최소값의 차이를 구하시오
df3.apply(lambda x : x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [74]:
# Q 각 열에 값들에 건수를 추출
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [84]:
# Q. 타이타닉호의 승객중 나이가 20살을 기준으로 성인(Adult)과 미성년자(child)
# 구별하여 차생변수 adult/child에 담는다
titanic['adult/child'] = titanic.apply(lambda df : 'adult' if df.age >= 20 else 'child', axis = 1)
titanic.sample(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
497,0,3,male,NaN,0,0,15.1000,S,Third,man,True,NaN,Southampton,no,True,child
589,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,child
65,1,3,male,NaN,1,1,15.2458,C,Third,man,True,NaN,Cherbourg,yes,False,child
312,0,2,female,26.0,1,1,26.0000,S,Second,woman,False,NaN,Southampton,no,False,adult
756,0,3,male,28.0,0,0,7.7958,S,Third,man,True,NaN,Southampton,no,True,adult
125,1,3,male,12.0,1,0,11.2417,C,Third,child,False,NaN,Cherbourg,yes,False,child
20,0,2,male,35.0,0,0,26.0000,S,Second,man,True,NaN,Southampton,no,True,adult
560,0,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,child
223,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,child
827,1,2,male,1.0,0,2,37.0042,C,Second,child,False,NaN,Cherbourg,yes,False,child

In [85]:
def adult_child(df):
    if df.age >= 20:
        'adult'
    else:
        'chile'

In [87]:
titanic.apply(adult_child(titanic), axis=1)

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [90]:
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

#### fillna()
- NaN 값을 원하는 값으로 대체하는 함수

In [93]:
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [95]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

#### 타이타닉호의 승객의 나이중 NaN으로 나이가 명사지되 않는 고객의 나이를
#### 평균 나이값으로 대체하는 작업을 수행

In [135]:
mean = titanic['age'].mean()
mean

29.69911764705876

In [136]:
titanic['age'] = titanic['age'].fillna(mean)
titanic.sample(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
446,1,2,female,13.0,0,1,19.5000,S,Second,child,False,NaN,Southampton,yes,False
320,0,3,male,22.0,0,0,7.2500,S,Third,man,True,NaN,Southampton,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
438,0,1,male,64.0,1,4,263.0000,S,First,man,True,C,Southampton,no,False
378,0,3,male,20.0,0,0,4.0125,C,Third,man,True,NaN,Cherbourg,no,True

#### astype() : 자료형을 바꾸는 함수

In [138]:
df3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

#### 데이터프레임의 인덱스 설정 및 제거
- set_index :  기존의 행 인덱스를 제거하고 데이터 열중 하나를 인덱스로 설정
- reset_index : 기존의 행 인덱스를 제거하고 인덱스를 데이터 열로 추가

In [154]:
df1 = pd.DataFrame(np.vstack([list('ABCDE'), np.round(np.random.rand(3, 5), 2)]).T,
                  columns=['C1','C2','C3','C4'])
df1

  C1    C2    C3    C4
0  A  0.83  0.92  0.73
1  B  0.29  0.71  0.25
2  C  0.78  0.96  0.89
3  D  0.45  0.59  0.77
4  E  0.23  0.94  0.45

In [155]:
df2 = df1.set_index('C1')
df2

      C2    C3    C4
C1
A   0.83  0.92  0.73
B   0.29  0.71  0.25
C   0.78  0.96  0.89
D   0.45  0.59  0.77
E   0.23  0.94  0.45

In [156]:
df2.set_index('C2')

        C3    C4
C2
0.83  0.92  0.73
0.29  0.71  0.25
0.78  0.96  0.89
0.45  0.59  0.77
0.23  0.94  0.45

In [164]:
df2.reset_index()

  C1    C2    C3    C4
0  A  0.83  0.92  0.73
1  B  0.29  0.71  0.25
2  C  0.78  0.96  0.89
3  D  0.45  0.59  0.77
4  E  0.23  0.94  0.45

In [166]:
df2.reset_index(drop=True)

     C2    C3    C4
0  0.83  0.92  0.73
1  0.29  0.71  0.25
2  0.78  0.96  0.89
3  0.45  0.59  0.77
4  0.23  0.94  0.45

### 다중 인덱스

In [219]:
df3 = pd.DataFrame(np.round(np.random.randn(5,4), 2),
                  columns = [['A','A','B','B'],
                             ['C1','C2','C1','C2',]])
df3
df3.columns

MultiIndex([('A', 'C1'),
            ('A', 'C2'),
            ('B', 'C1'),
            ('B', 'C2')],
           )

In [220]:
df3.columns.names= ['Cidx1','Cidx1']
df3

Cidx1     A           B
Cidx1    C1    C2    C1    C2
0     -0.01  0.88  2.77  0.42
1     -1.28  0.19 -0.41 -0.77
2     -1.75 -0.85  1.21  0.73
3     -0.44 -0.12  1.96 -0.75
4      1.84  0.36  1.09  0.16

In [174]:
df3.index

RangeIndex(start=0, stop=5, step=1)

In [183]:
df4 = pd.DataFrame(np.round(np.random.randn(6,4), 2),
                  columns = [['A','A','B','B'],['C','D','C','D']],
                  index = [['M','M','M','F','F','F'],['id_' + str(i + 1) for i in range(3)]*2])
df4

           A           B
           C     D     C     D
M id_1  1.55 -0.07  0.77  0.36
  id_2  0.09  0.02  0.45  0.43
  id_3 -0.67  0.69 -0.76  0.11
F id_1  1.26 -0.25  0.16  0.10
  id_2  0.48  0.17  2.54  0.75
  id_3 -0.52 -0.10  0.46 -0.06

In [185]:
['id_' + str(i + 1) for i in range(3)] * 2

['id_1', 'id_2', 'id_3', 'id_1', 'id_2', 'id_3']

In [190]:
df4.columns.names = ['Cidx1','Cidx2']
df4.index.names = ['Ridx1','Ridx2']
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.55 -0.07  0.77  0.36
      id_2   0.09  0.02  0.45  0.43
      id_3  -0.67  0.69 -0.76  0.11
F     id_1   1.26 -0.25  0.16  0.10
      id_2   0.48  0.17  2.54  0.75
      id_3  -0.52 -0.10  0.46 -0.06

In [194]:
# 행인덱스와 열인덱스 교환
## stack() : 열인덱스 -> 행인덱스
## unstack() : 행인덱스 => 열인덱스

df4.stack('Cidx1')

Cidx2                 C     D
Ridx1 Ridx2 Cidx1
M     id_1  A      1.55 -0.07
            B      0.77  0.36
      id_2  A      0.09  0.02
            B      0.45  0.43
      id_3  A     -0.67  0.69
            B     -0.76  0.11
F     id_1  A      1.26 -0.25
            B      0.16  0.10
      id_2  A      0.48  0.17
            B      2.54  0.75
      id_3  A     -0.52 -0.10
            B      0.46 -0.06

In [196]:
df4.stack(1)

Cidx1                 A     B
Ridx1 Ridx2 Cidx2
M     id_1  C      1.55  0.77
            D     -0.07  0.36
      id_2  C      0.09  0.45
            D      0.02  0.43
      id_3  C     -0.67 -0.76
            D      0.69  0.11
F     id_1  C      1.26  0.16
            D     -0.25  0.10
      id_2  C      0.48  2.54
            D      0.17  0.75
      id_3  C     -0.52  0.46
            D     -0.10 -0.06

In [224]:
df3

Cidx1     A           B
Cidx1    C1    C2    C1    C2
0     -0.01  0.88  2.77  0.42
1     -1.28  0.19 -0.41 -0.77
2     -1.75 -0.85  1.21  0.73
3     -0.44 -0.12  1.96 -0.75
4      1.84  0.36  1.09  0.16

In [222]:
# 다중 인덱스를 가지고 있는 경우에 인덱스 값이 하나의 라벨이나 숫자 아니라 튜풀로 둘려싸여야 한다.
df3[('B','C1')]

0    2.77
1   -0.41
2    1.21
3    1.96
4    1.09
Name: (B, C1), dtype: float64

In [223]:
# df3.loc[행인덱스], 열인덱스]
df3.loc[0, ('B','C1')]

2.77

In [230]:
# df3.loc[행인덱스], 열인덱스]
df3.loc[1, ('B','C1')] = 100
df3

Cidx1     A             B
Cidx1    C1    C2      C1    C2
0     -0.01  0.88  100.00  0.42
1     -1.28  0.19  100.00 -0.77
2     -1.75 -0.85    1.21  0.73
3     -0.44 -0.12    1.96 -0.75
4      1.84  0.36    1.09  0.16

In [233]:
# iloc 인덱스를 사용할 경우에는 튜풀 형태의 다중인덱스를 하용할 수 없다
df3.iloc[0, 2]

100.0

In [235]:
df3['A']

Cidx1    C1    C2
0     -0.01  0.88
1     -1.28  0.19
2     -1.75 -0.85
3     -0.44 -0.12
4      1.84  0.36

In [236]:
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.55 -0.07  0.77  0.36
      id_2   0.09  0.02  0.45  0.43
      id_3  -0.67  0.69 -0.76  0.11
F     id_1   1.26 -0.25  0.16  0.10
      id_2   0.48  0.17  2.54  0.75
      id_3  -0.52 -0.10  0.46 -0.06

In [238]:
df4.loc[('M','id_1'), ('A','C')]

1.55

## 데이터 프레임 합성 : merge. concatenate

In [257]:
df1 = pd.DataFrame({'고객번호':[1001, 1002, 1003, 1004, 1005, 1006, 1007],
                    '고객이름':['고둘리','도우너','또치','그냥또치','고길동','고희동','마이콜']},
                  columns = ['고객번호','고객이름'])
df1

   고객번호  고객이름
0  1001   고둘리
1  1002   도우너
2  1003    또치
3  1004  그냥또치
4  1005   고길동
5  1006   고희동
6  1007   마이콜

In [263]:
df2 = pd.DataFrame({'고객번호':[1001, 1001, 1005, 1006, 1007, 1001],
                    '예금금액':[10000, 20000, 15000, 5000, 100000, 30000]},
                  columns = ['고객번호','예금금액'])
df2

   고객번호    예금금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1007  100000
5  1001   30000

In [264]:
# Inner join 공통적인 것 없는 것는 안 노옴
pd.merge(df1, df2) # outer도 있다

   고객번호 고객이름    예금금액
0  1001  고둘리   10000
1  1001  고둘리   20000
2  1001  고둘리   30000
3  1005  고길동   15000
4  1006  고희동    5000
5  1007  마이콜  100000

In [260]:
pd.merge(df1, df2, how = 'left')

   고객번호  고객이름      예금금액
0  1001   고둘리   10000.0
1  1001   고둘리   20000.0
2  1001   고둘리   30000.0
3  1002   도우너       NaN
4  1003    또치       NaN
5  1004  그냥또치       NaN
6  1005   고길동   15000.0
7  1006   고희동    5000.0
8  1007   마이콜  100000.0

In [261]:
pd.merge(df1, df2, how = 'right')

   고객번호 고객이름    예금금액
0  1001  고둘리   10000
1  1001  고둘리   20000
2  1005  고길동   15000
3  1006  고희동    5000
4  1007  마이콜  100000
5  1001  고둘리   30000

In [266]:
# join 메섣, : 행이넫ㄱ스를 기준으로 결합한다.
# join이 하기전에 index를 설정해야 함

df1.set_index('고객번호', inplace=True)
df2.set_index('고객번호', inplace=True)
df1.join(df2, how = 'outer')

      고객이름      예금금액
고객번호
1001   고둘리   10000.0
1001   고둘리   20000.0
1001   고둘리   30000.0
1002   도우너       NaN
1003    또치       NaN
1004  그냥또치       NaN
1005   고길동   15000.0
1006   고희동    5000.0
1007   마이콜  100000.0

### concat 함수
- 가준열을 사용하지 않고 단순히 데이터를 연결하는 방식
- index 중복 될 수 있음 ***

In [268]:
s1 = pd.Series([0, 1], index=['A','B'])
s2 = pd.Series([2, 3, 4], index=['A','B','C'])

In [269]:
s1

A    0
B    1
dtype: int64

In [270]:
s2

A    2
B    3
C    4
dtype: int64

In [274]:
# 중복
pd.concat([s1,s2], axis = 0)

A    0
B    1
A    2
B    3
C    4
dtype: int64

In [ ]:
# 세로
pd.concat([s1,s2], axis = 1)

In [278]:
df1 = pd.DataFrame(np.arange(6).reshape(3,2),
                  index = list('abc'),
                  columns=['데이터1','데이터2'])
df1

   데이터1  데이터2
a     0     1
b     2     3
c     4     5

In [279]:
df2 = pd.DataFrame(5+np.arange(4).reshape(2,2),
                  index = list('ac'),
                  columns=['데이터3','데이터4'])
df2

   데이터3  데이터4
a     5     6
c     7     8

In [280]:
pd.concat([df1, df2], axis = 1)

   데이터1  데이터2  데이터3  데이터4
a     0     1   5.0   6.0
b     2     3   NaN   NaN
c     4     5   7.0   8.0

In [283]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ['도시', '연도', '인구', '지역']
df1 = pd.DataFrame(data, columns = columns)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [285]:
# pivot(행인덱스로 사용할 열이름, 열인덱스로 사용할 열이름, 데이터로 사용할 열이름)
df1.pivot('도시', '연도', '인구')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

### GroupBy 분석  - groupby()
메서드
- size, count : 그룹 데이터의 갯수
- mean, median, min, max
- sum, prod, std, var, quantile
- first, last
- agg, aggreate (데이터 묶어서 여러 연산을 할떄)
- describe 기초통계량 표준쳔찬까지 보여줌
- apply
- transform

In [288]:
df2 = pd.DataFrame({'key1':list('AABBA'),
                    'key2':['one','two','one','two','one'],
                    'data1':[1,2,3,4,5],
                    'data2':[10, 20, 30, 40, 50]})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [290]:
# 그룹 설정
groups = df2.groupby(df2.key1)
groups

In [291]:
# 그룹화한 것들의 인덱스가 저장되어 있다.
groups.groups

{'A': [0, 1, 4], 'B': [2, 3]}

In [292]:
# A그룹과 B그룹의 데이터들의 합계를 구하시오
groups.sum()

      data1  data2
key1
A         8     80
B         7     70

In [297]:
df2.data1.groupby(df2.key1).sum()

key1
A    8
B    7
Name: data1, dtype: int64

In [298]:
df2.groupby(df2.key1)['data1'].sum()

key1
A    8
B    7
Name: data1, dtype: int64

In [309]:
df2.groupby(df2.key1).sum()[['data1','data2']]

      data1  data2
key1
A         8     80
B         7     70

In [304]:
df2.data1.groupby([df2.key1,df2.key2]).sum()

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64

In [286]:
a = pd.DataFrame(np.round(np.random.randn(4,4),2))
a

a.index = [['a','b','c','d'],['f','m','f','m']]
a.columns = [['l','l','r','r'],['z','x','z','x']]

a.index.names = ['s1','s2']
a.columns.names = ['a1','a2']

a

a1        l           r
a2        z     x     z     x
s1 s2
a  f  -1.69  2.26 -0.05 -0.29
b  m  -1.69  0.13 -0.71  1.13
c  f   0.25 -1.90 -1.10  0.85
d  m   0.03  0.91 -3.28  1.42